// 1. Однакові цифри в діапазоні

// Створіть веб-програму, в якій користувач вводить два числа (межі діапазону) від 10 до 99. Потрібно знайти і вивести в консоль через кому всі числа в діапазоні, які мають хоч дві однакові цифри.

let a = prompt('Введіть початок діапазону, число від 10 до 99', "10");
let z = prompt('Введіть кінець діапазону, число від 10 до 99', "99");

for (i = a; i <= z; i++) {    

     firstNum = Math.floor((i / 10) % 10);
     secondNum = Math.floor(i % 10);

        if (firstNum == secondNum) {
        answer = firstNum + `${secondNum}`;

        console.log(answer);
    } 
}
 
     
// 2. Малювання у консолі

// Створіть веб-програму, в якій користувач вводить ширину та символ. Вивести в консоль лінію заданої ширини заданим символом

// let width = +prompt('Введіть ширину', "5");
// let symbol1 = prompt('Введіть символ', "!");
// let answer = '';

// for (let i = 0; i < width; i++) {
    
//     answer += symbol1;

//     console.log(answer);

// }

let width = +prompt('Введіть ширину', "5");
let symbol = prompt('Введіть символ', "!");

let answer = symbol.repeat(width);    

console.log(answer);



// 3. Зграя драконів**

// Є переказ, що дракони бувають багатоголові. І чим більше голів у дракона, тим більша сила підвладна йому. Але страшнішим за дракона може бути тільки зграя драконів. І страшна та зграя тим, що сила її не сумується від голів драконів, а примножується. Якщо в зграї тієї 3 дракона з 2, 4 і 5 головами, то загальною силою вони можуть пооперувати з міфічним 40-головим іродовим драконищем. Тому Вам, волхви шановні, належить написати закляття мудрене. Лазутчики голови порахують здалеку, а ваше завдання сказати, якою може бути максимальна сила тієї зграї. До чого готуватися захисникам бравим, які заклинання готувати чарівникам сивоволосим.


let dragonHeads = prompt('Сільки голів в стаї драконів?');

let maxPower = 1;

while(dragonHeads > 4) {
    maxPower *= 3;
    dragonHeads -= 3;
}

maxPower *=  dragonHeads;

console.log(maxPower);